Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/pre_school_education_and_childcare/index.html.txt.tmx
Source language: en
Languages: ga

source: Pre-school education and childcare
ga: Oideachas Réamhscoile agus Cúram Leanaí

source: Overview Document Your childcare options Describes the different types of child care which are available to parents including creches, childminders, pre-schools
ga: Overview Document Do roghanna maidir le cúram leanaí Tá cur síos ann ar na cineálacha éagsúla cúram leanaí atá ar fáil do thuismitheoirí, idir naíolanna, feighlithe leanaí agus réamhscoileanna, cuir i gcás

source: Early Start is a programme designed to boost educational achievement among disadvantaged three- and four-year-old children
ga: Clár a cuireadh le chéile le cumas oideachais páistí 3 bliana agus 4 bliana ó cheantair faoi mhíbhuntáiste é Túsluath

source: Information on childhood education, including the role of the Department of Education and Skills
ga: Eolas ar luathoideachais an pháiste, an ról atá ag an Roinn Oideachais agus Scileanna, polasaí an rialtais agus rialacháin cúram leanaí

source: Regulation of pre-school childcare services
ga: Rialúchán na soláthraithe seirbhísí chúram leanaí réamhscoile

source: Pre-school childcare providers are regulated by law
ga: Tá soláthróirí chúram páistí réamhscolaíochta in Éirinn rialaithe ag an dlí

source: Find out about the rules concerning play groups, day nurseries,crèches, childminders and other service providers
ga: Faigh eolas maidir le rialacha a bhaineann le naíonraí, naíolanna lae, creiseanna, feighlithe páistí agus soláthróirí seirbhíse eile

source: Early Childhood Care and Education Scheme
ga: Scéim Cúraim agus Oideachais Luath-Óige

source: The ECCE scheme provides a free year of early childhood care and education for children of pre-school age
ga: Is í aidhm na scéime ná bliain cúraim agus oideachais luathóige a sholáthar saor in aisce do leanaí atá in aois réamhscolaíochta

source: Community Childcare Subvention (CCS) Programme
ga: Clár Fóirdheontais Chúram Leanaí Pobail (CCS)

source: Childcare during vocational training
ga: Cúram Leanaí le linn cúrsaí gairmoiliúna

source: You may qualify for a subsidised childcare place, if you are attending certain types of vocational training provided by an Education and Training Board (ETB), Momentum or Community Employment
ga: Tá scéim chúraim leanaí ann do dhaoine atá ag freastal ar chlár oiliúna gairme de chuid FÁS

source: This document is in: Education and Training > Vocational education and training
ga: This document is in: Oideachas agus Oiliúint > Gairmoideachas agus oiliúint

source: Community Employment Childcare Programme
ga: An Clár Fostaíocht Pobail um Chúram Leanaí

source: Provides childcare places at reduced rates for Community Employment (CE) applicants who need childcare so that they can take up a place on a CE scheme
ga: Soláthraíonn sé áiteanna i gcúram leanaí ar rátaí laghdaithe d’iarratasóirí ar an gclár Fostaíocht Pobail (CE) a dteastaíonn cúram leanaí uathu ionas gur féidir leo glacadh le háit ar scéim fostaíocht pobail

source: After-School Child Care Scheme
ga: An Scéim Cúram Leanaí Iarscoile

source: If you have been unemployed and you get a new job, increase the number of hours that you work or take up a place on an employment support scheme you may be eligible for a subsidised afterschool childcare place for primary school children
ga: Más rud é go raibh tú dífhostaithe agus go bhfaigheann tú post nua, nó go méadaíonn tú líon na laethanta a oibríonn tú nó go dtéann tú i mbun scéim tacaíocht fostaíochta, is féidir go mbeidh tú incháilithe d’áit fhóirdheonaithe i gcúram leanaí do leanaí bunscoile

source: This document is in: Social Welfare > Social welfare payments > Social welfare payments and work
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Íocaíochtaí Leasa Shóisialaigh agus Obair

source: Most Read in "Education and Training"
ga: Ábhar is mó éilimh i "Oideachas agus Oiliúint"

source: School terms in primary and post-primary schools
ga: Téarmaí scoile i mbunscoileanna agus iarbhunscoileanna

source: Further Education and Training (FET) allowances
ga: Liúntais Bhreisoideachais agus Oiliúna (BOO)
